# -*- coding: utf-8 -*-
"""Задача 2.2

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1FAOcX8gfNVDGKcFdeSWJyFuNVx3ZuG9U

### Задача 2.2. 

#### Напишите функцию, которая возвращает номер квартал по номеру месяца
* Например: 
*месяц 2 (февраль) является частью первого квартала; 
*месяц 6 (июнь) является частью второго квартала; 
*месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
    pass
"""

def quarter_of(month):
 if month < 1 or month > 12:
  return None
  return (month - 1) // 3 + 1

#Примеры использования:
print(quarter_of(2))  # 1
print(quarter_of(6))  # 2
print(quarter_of(11))  # 4
print(quarter_of(13))  # None (неверный номер месяца)