# -*- coding: utf-8 -*-
"""Untitled2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1zIEg2wtWPsXjigpQKGlsDYdbG-kCSLD0

# Задача 1.1.
### Есть строка с перечислением песен
* my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
#### Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
#### Нельзя переопределять my_favorite_songs и запятая не должна выводиться.
"""

str = "my_favorite_songs= Waste Moment Staying, Alive, A Sorta Fairytale, Start Me Up, New Salvation"
print (len(str))
print(str [-93:-54])
print(str [-93:-75] + str [-14:])
print(str [-93:-75] + str [-53:-47])
print(str [-93:-75] + str [-27:-15])