# -*- coding: utf-8 -*-
"""Задача 1.3

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1vfZiyaiBbnmU6y5PjunTKMI0oVYpACOR
"""



"""###Задача 1.3.
Напишите скрипт, который принимает от пользователя номер месяца, а возвращает количество дней в нем.
Результат проверки вывести на консоль
Допущение: в феврале 28 дней
Если номер месяца некорректен - сообщить об этом
Например,
* Введите номер месяца: 3
* Вы ввели март. 31 дней

* Введите номер месяца: 2
* Вы ввели февраль. 28 дней

* Введите номер месяца: 15
* Такого месяца нет!
"""

num = int(input("Введите номер месяца: "))

if num < 1 or num > 12:
 print("Такого месяца нет!")
elif num == 2:
 print("Вы ввели февраль. 28 дней")
elif num in [4]:
 print("Вы ввели месяц апрель, который имеет 30 дней.")
elif num in [6]:
 print("Вы ввели месяц июнь, который имеет 30 дней.")
elif num in [9]:
 print("Вы ввели месяц сентябрь, который имеет 30 дней.")
elif num in [11]:
 print("Вы ввели месяц ноябрь, который имеет 30 дней.")
elif num in [1]:
 print("Вы ввели месяц январь, который имеет 31 день.")
elif num in [3]:
 print("Вы ввели месяц март , который имеет 31 день.")
elif num in [5]:
 print("Вы ввели месяц январь, который имеет 31 день.")
elif num in [7]:
 print("Вы ввели месяц июль, который имеет 31 день.")
elif num in [10]:
 print("Вы ввели месяц октябрь, который имеет 31 день.")
elif num in [12]:
 print("Вы ввели месяц декабрь, который имеет 31 день.")