# -*- coding: utf-8 -*-
"""Задача 4.1

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1J-6bjmbcbmMU24f_xNYeLaNSWUZucrul

###Домашнее задание на SQL
В базе данных teacher создайте таблицу Students
Структура таблицы: Student_Id - Integer, Student_Name - Text, School_Id - Integer (Primary key)
Наполните таблицу следующими данными:
201, Иван, 1
202, Петр, 2
203, Анастасия, 3
204, Игорь, 4
Напишите программу, с помощью которой по ID студента можно получать информацию о школе и студенте.
Формат вывода:
ID Студента:
Имя студента:
ID школы:
Название школы:
"""

import sqlite3
import pandas as pd
connection = sqlite3.connect("Students.db")
query = "SELECT * FROM Students"
df = pd.read_sql(query,connection)
print(df)

connection2 = sqlite3.connect("teachers.db")
df.to_sql("Students", connection2, index = False)
print('ok')

import sqlite3

def get_student(student_id):
  connection = sqlite3.connect("teachers.db")
  cursor = connection.cursor()
  query = "SELECT * FROM School JOIN Students ON School.School_Id = Students.School_Id WHERE Students.Student_id = ?"
  cursor.execute(query,(student_id,))
  records = cursor.fetchall()
  print(records)
  for row in records:
    print()

get_student(201)